<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-test-dev-deploy","backend_type":"remote","backend":"731971ec31f18dfea3d50710cfd4c80e9037ef20f46e191cf5dfb7c825dbcfcc","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #267 at https://github.com/scidsg/hushline/actions/runs/10839880904","plan_out_hash":"cacbfbba38feb37a9294185e13dba6164fb4b8053768a2ceaa8f667195c3133e","plan_hash":"daeebdee8f70d6d5a49710006afe15cd851e6226c345aa409ae0a6eceb948f5b","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-test-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
branch = "test-dev-deploy"
name   = "dev-test-dev-deploy"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = "************************************"
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "dev-test-dev-deploy"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "test-dev-deploy"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }

+           worker {
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               name               = "db"

+               image {
+                   registry_type = "DOCKER_HUB"
+                   repository    = "postgres"
+                   tag           = "16.4-alpine3.20"

+                   deploy_on_push (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #267](https://github.com/scidsg/hushline/actions/runs/10839880904)